CREATE DATABASE  IF NOT EXISTS `tripeer` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `tripeer`;
-- MySQL dump 10.13  Distrib 8.0.36, for Win64 (x86_64)
--
-- Host: k10d207.p.ssafy.io    Database: tripeer
-- ------------------------------------------------------
-- Server version	8.0.22

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `weather_data`
--

DROP TABLE IF EXISTS `weather_data`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `weather_data` (
  `weather_data_id` int NOT NULL AUTO_INCREMENT,
  `hourly_temp` varchar(255) DEFAULT NULL,
  `precip_prob` varchar(255) DEFAULT NULL,
  `precip_type` varchar(255) DEFAULT NULL,
  `sky_cond` varchar(255) DEFAULT NULL,
  `time` varchar(255) DEFAULT NULL,
  `weather_id` int DEFAULT NULL,
  PRIMARY KEY (`weather_data_id`),
  KEY `FKntehu79l7lrpw6um6ivv4q2ep` (`weather_id`),
  CONSTRAINT `FKntehu79l7lrpw6um6ivv4q2ep` FOREIGN KEY (`weather_id`) REFERENCES `weather` (`weather_id`)
) ENGINE=InnoDB AUTO_INCREMENT=434 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `weather_data`
--

LOCK TABLES `weather_data` WRITE;
/*!40000 ALTER TABLE `weather_data` DISABLE KEYS */;
INSERT INTO `weather_data` VALUES (314,'13','0','없음','맑음','00',14),(315,'13','0','없음','맑음','01',14),(316,'13','0','없음','맑음','02',14),(317,'13','0','없음','맑음','03',14),(318,'12','0','없음','맑음','04',14),(319,'12','0','없음','맑음','05',14),(320,'12','0','없음','맑음','06',14),(321,'13','0','없음','맑음','07',14),(322,'15','20','없음','구름많음','08',14),(323,'18','0','없음','맑음','09',14),(324,'20','20','없음','구름많음','10',14),(325,'22','0','없음','맑음','11',14),(326,'23','0','없음','맑음','12',14),(327,'24','0','없음','맑음','13',14),(328,'25','0','없음','맑음','14',14),(329,'25','0','없음','맑음','15',14),(330,'25','0','없음','맑음','16',14),(331,'24','0','없음','맑음','17',14),(332,'23','0','없음','맑음','18',14),(333,'21','0','없음','맑음','19',14),(334,'20','0','없음','맑음','20',14),(335,'19','0','없음','맑음','21',14),(336,'18','0','없음','맑음','22',14),(337,'18','0','없음','맑음','23',14),(338,'9','60','비','흐림','00',15),(339,'9','60','비','흐림','01',15),(340,'10','60','비','흐림','02',15),(341,'10','60','비','흐림','03',15),(342,'9','60','비','흐림','04',15),(343,'10','20','없음','구름많음','05',15),(344,'10','30','없음','흐림','06',15),(345,'11','30','없음','흐림','07',15),(346,'13','20','없음','구름많음','08',15),(347,'14','20','없음','구름많음','09',15),(348,'16','20','없음','구름많음','10',15),(349,'18','20','없음','구름많음','11',15),(350,'19','20','없음','구름많음','12',15),(351,'20','0','없음','맑음','13',15),(352,'21','20','없음','구름많음','14',15),(353,'21','20','없음','구름많음','15',15),(354,'21','20','없음','구름많음','16',15),(355,'20','20','없음','구름많음','17',15),(356,'19','20','없음','구름많음','18',15),(357,'17','0','없음','맑음','19',15),(358,'17','0','없음','맑음','20',15),(359,'16','0','없음','맑음','21',15),(360,'15','0','없음','맑음','22',15),(361,'14','0','없음','맑음','23',15),(362,'13','60','비','흐림','00',16),(363,'12','20','없음','구름많음','01',16),(364,'12','20','없음','구름많음','02',16),(365,'11','60','비','흐림','03',16),(366,'10','30','없음','흐림','04',16),(367,'10','60','비','흐림','05',16),(368,'10','30','없음','흐림','06',16),(369,'11','30','없음','흐림','07',16),(370,'13','30','없음','흐림','08',16),(371,'15','30','없음','흐림','09',16),(372,'17','20','없음','구름많음','10',16),(373,'19','0','없음','맑음','11',16),(374,'21','0','없음','맑음','12',16),(375,'22','0','없음','맑음','13',16),(376,'22','0','없음','맑음','14',16),(377,'22','0','없음','맑음','15',16),(378,'22','0','없음','맑음','16',16),(379,'21','0','없음','맑음','17',16),(380,'20','0','없음','맑음','18',16),(381,'18','0','없음','맑음','19',16),(382,'17','0','없음','맑음','20',16),(383,'16','0','없음','맑음','21',16),(384,'16','0','없음','맑음','22',16),(385,'15','0','없음','맑음','23',16),(386,'15','0','없음','맑음','00',17),(387,'14','0','없음','맑음','01',17),(388,'13','0','없음','맑음','02',17),(389,'13','0','없음','맑음','03',17),(390,'12','0','없음','맑음','04',17),(391,'12','0','없음','맑음','05',17),(392,'12','0','없음','맑음','06',17),(393,'15','0','없음','맑음','07',17),(394,'17','0','없음','맑음','08',17),(395,'19','0','없음','맑음','09',17),(396,'20','0','없음','맑음','10',17),(397,'21','0','없음','맑음','11',17),(398,'22','0','없음','맑음','12',17),(399,'21','0','없음','맑음','13',17),(400,'19','30','없음','흐림','14',17),(401,'17','30','없음','흐림','15',17),(402,'14','30','없음','흐림','16',17),(403,'13','60','비','흐림','17',17),(404,'13','60','비','흐림','18',17),(405,'13','60','비','흐림','19',17),(406,'12','60','비','흐림','20',17),(407,'12','60','비','흐림','21',17),(408,'12','60','비','흐림','22',17),(409,'11','30','없음','흐림','23',17),(410,'9','63','비','흐림','00',18),(411,'9','62','비','흐림','01',18),(412,'10','64','비','흐림','02',18),(413,'10','64','비','흐림','03',18),(414,'10','72','비','흐림','04',18),(415,'9','71','비','흐림','05',18),(416,'9','63','비','흐림','06',18),(417,'10','60','비','흐림','07',18),(418,'11','60','비','흐림','08',18),(419,'12','60','비','흐림','09',18),(420,'12','30','없음','흐림','10',18),(421,'13','60','비','흐림','11',18),(422,'13','30','없음','흐림','12',18),(423,'14','30','없음','흐림','13',18),(424,'15','30','없음','흐림','14',18),(425,'15','20','없음','구름많음','15',18),(426,'16','20','없음','구름많음','16',18),(427,'16','30','없음','흐림','17',18),(428,'16','20','없음','구름많음','18',18),(429,'15','20','없음','구름많음','19',18),(430,'15','20','없음','구름많음','20',18),(431,'14','0','없음','맑음','21',18),(432,'14','0','없음','맑음','22',18),(433,'15','0','없음','맑음','23',18);
/*!40000 ALTER TABLE `weather_data` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-05-17 13:11:59
